test/load-test.yaml
config:
  target: "http://localhost:5050"
  phases:
    - duration: 6
      name: "Normal usage"
      arrivalRate: 3
  processor: "./load-test-helper.js"

scenarios:
  - name: "Complete flow"
    flow:
      - post:
          url: "/register"
          beforeRequest: generateRegisterData
          json:
            username: "{{username}}"
            salt: "{{salt}}"
            verifier: "{{verifier}}"
      - post:
          url: "/generate"
          beforeRequest: generateEphemeralData
          json:
            username: "{{username}}"
            ephemeral: "{{clientPublic}}"
          capture: 
            json: "$.ephemeral"
            as: "serverPublic"
      - post:
          url: "/login"
          beforeRequest: generateProof
          json:
            username: "{{username}}"
            proof: "{{clientProof}}"
          capture: 
            json: "$.token"
            as: "authToken"
      - post:
          url: "/savepasswords"
          headers:
            Authorization: "Bearer {{authToken}}"
          beforeRequest: generatePasswordData
          json:
            passwordData: "{{passwordData}}"
            encryptionIV: "{{encryptionIV}}"
            tag: ""
      - think: 5
      - get:
          url: "/getpasswords"
          headers:
            Authorization: "Bearer {{authToken}}"
          capture:
            json: "$.passwordData"
            as: "passwordDataResponse"
          expect: 
            statusCode: 200
            equals:
              - "{{passwordDataResponse}}"
              - "{{passwordData}}"